asomers/freebsd-src/lib/geom/zoned/gzoned.8
.\" Copyright (c) 2026 voidanix <voidanix@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 9, 2026
.Dt GZONED 8
.Os
.Sh NAME
.Nm gzoned
.Nd "emulate a host-managed zoned device on top of a regular provider"
.Sh SYNOPSIS
.Nm
.Cm create
.Op Fl v
.Op Fl s Ar zonesize
.Op Fl r Ar zones
.Ar dev
.Nm
.Cm destroy
.Op Fl v
.Ar dev ...
.Nm
.Cm stop
.Op Fl fv
.Ar name ...
.Sh DESCRIPTION
The
.Nm
utility presents an ordinary, non-zoned storage provider to the rest of
the system as a host-managed zoned block device, of the kind described by
the SCSI Zoned Block Commands (ZBC) and ATA Zoned ATA Command Set (ZAC)
specifications.
.Pp
The backing provider is divided into equally sized zones, which are
sequential-write-required unless marked conventional with the
.Fl r
option.
For each zone the GEOM class maintains a write pointer and answers the
zone-management commands
.Pq report zones, get parameters, open, close, finish and reset write pointer
issued through the
.Dv DIOCZONECMD
ioctl.
Reads and writes are passed through to the backing provider, but a write to a
sequential zone is rejected with
.Er EIO
unless it begins at that zone's current write pointer and stays within a
single zone.
.Pp
The configuration is persistent.
A metadata block and the per-zone state are stored in a small area reserved at
the tail of the backing provider, so the zoned device is recreated
automatically whenever the provider appears
.Pq at boot, module load or hot-plug ,
with its write pointers restored.
Zone-state changes are committed to the backing provider on a cache flush
.Pq Dv BIO_FLUSH ;
changes made since the last flush may be rolled back by an unclean shutdown,
just as with a drive whose zone state is volatile until flushed.
.Pp
The first argument to
.Nm
indicates an action to be performed:
.Bl -tag -width ".Cm destroy"
.It Cm create
Mark
.Ar dev
as zoned, creating a device named after the backing provider with
.Dq .zoned
appended
.Pq e.g. Pa /dev/da0.zoned .
The number of zones is the usable size of
.Ar dev
divided by
.Ar zonesize ;
a small reservation at the tail of
.Ar dev
holds the zone metadata, and any trailing space that does not make up a full
zone is not exposed.
.It Cm destroy
Permanently un-zone the given backing device(s) by clearing the on-disk
metadata.
The live zoned device, if any, is torn down.
.Ar dev
is the backing provider
.Pq e.g. Pa /dev/da0 ,
not the zoned device name.
.It Cm stop
Tear down the given zoned device(s) without touching the on-disk metadata.
.Ar name
is the zoned device
.Pq e.g. Pa da0.zoned ,
not the backing provider.
Unflushed zone state is committed to the backing provider first.
The device comes back the next time the backing provider is tasted
.Pq e.g. at boot or when it is opened and closed again .
.El
.Pp
Additional options:
.Bl -tag -width ".Fl s Ar zonesize"
.It Fl f
Stop the device even if it is still open.
.It Fl r Ar zones
Mark the given zones as conventional
.Pq randomly writable, no write pointer .
.Ar zones
is a comma-separated list of zone numbers and inclusive ranges, counted
from zero, e.g.\&
.Ar 60 ,
.Ar 60-70
or
.Ar 0-3,60,90-95 .
At most 16 comma-separated entries may be given.
By default all zones are sequential-write-required.
.It Fl s Ar zonesize
Size of a single zone.
The value must be a multiple of the backing provider's sector size and may use
the usual size suffixes
.Pq e.g. Ar 256M , 1G .
The default is
.Ar 256M .
.It Fl v
Be more verbose.
.El
.Sh SYSCTL VARIABLES
The following
.Xr sysctl 8
variable can be used to control the behavior of the
.Nm ZONED
GEOM class.
.Bl -tag -width indent
.It Va kern.geom.zoned.debug : No 0
Debug level of the
.Nm ZONED
GEOM class.
This can be set to a number between 0 and 2 inclusive.
If set to 0, minimal debug information is printed; if set to 2, the maximum
amount of debug information is printed.
.El
.Sh EXIT STATUS
.Ex -std
.Sh EXAMPLES
Expose
.Pa /dev/da0
as a host-managed zoned device
.Pa /dev/da0.zoned
with one-gigabyte zones, the first four of which are conventional, inspect
its zones, then permanently un-zone it:
.Bd -literal -offset indent
gzoned create -s 1G -r 0-3 /dev/da0
zonectl -d /dev/da0.zoned -c params
zonectl -d /dev/da0.zoned -c rz
gzoned destroy /dev/da0
.Ed
.Pp
Because the configuration is persistent, after the
.Cm create
above the
.Pa da0.zoned
device reappears on its own after a reboot.
It can also be stopped and brought back manually without un-zoning the
backing provider:
.Bd -literal -offset indent
gzoned stop da0.zoned
.Ed
.Pp
The same operations are available through the
.Xr geom 8
front end:
.Bd -literal -offset indent
geom zoned create -s 1G /dev/da0
geom zoned stop da0.zoned
geom zoned destroy /dev/da0
.Ed
.Sh SEE ALSO
.Xr geom 4 ,
.Xr geom 8 ,
.Xr zonectl 8
.Sh HISTORY
The
.Nm
utility appeared in
.Fx 16.0 .
.Sh AUTHORS
.An voidanix Aq Mt voidanix@FreeBSD.org
